package com.andromeda.cms.admin.service;

public class RegexTest {

	public static void main(String[] args) {
		String str = "<p>కళాతపస్వీ కె.విశ్వనాథ్‌తో (K. Viswanath) తనకున్న అనుబంధాన్ని గుర్తు చేసుకున్నారు మెగాస్టార్‌ చిరంజీవి. తనను తెరపై కొత్తగా ఆవిష్కరించిన దర్శకుడు కె. విశ్వనాథ్‌ అని కొనియాడారు. సున్నితంగా నటించడం ఆయన దగ్గరే నేర్చుకున్నానని చిరంజీవి (chiranjeevi) చెప్పారు. కె విశ్వనాథ్‌ జయంతి సందర్భంగా హైదరాబాద్‌లో ‘కళాతపస్వికి కళాంజలి’ (Kalatapasviki kalanjali) కార్యక్రమం నిర్వహించారు. చిరంజీవితోపాటు కె.విశ్వనాథ్‌తో పని చేసిస పలువురు సినీ ప్రముఖులు ఈ కార్యక్రమంలో పాల్గొని తమ అనుబంధాన్ని చెప్పుకొచ్చారు.</p><p><img src=\\\"https://media-abn.s3.ap-south-1.amazonaws.com/media/2023/20230211/5555_25f3615ae3.jpg\\\" alt=\\\"5555.jpg\\\"></p><p>చిరంజీవి (chiranjeevi) మాట్లాడుతూ.. ‘‘మన సంస్కృతి, సంప్రదాయాల్ని ప్రపంచ స్థాయికి తీసుకెళ్లి మనందరినీ గర్వపడేలా చేసిన దిగ్దర్శకుడు కె.విశ్వనాథ్‌. నాకు అత్యంత ఇష్టమైన వ్యక్తిగా నా మనసులో స్థానం ఎప్పటికీ పదిలం. 'ఈ వేదిక విశ్వనాథ్‌గారి సంతాప స్థలంలా ఉండకూడదు ఓ సంబరంలా ఉండాలి. ఆయనతో ఉన్న అనుబంధాన్ని పంచుకోవాలి’ అని మేమంతా అనకున్నాం. దర్శకులు కాశీ విశ్వనాథ్‌, వీఎన్‌ ఆదిత్య, ఏడిద రాజా, పీపుల్‌ మీడియా సంస్థ, టి. సుబ్బిరామిరెడ్డి తదితరుల సహకారంతో సాధ్యమైంది. ఈ రకంగా విశ్వనాథ్‌గారి ఆత్మ శాంతిస్తుందని విశ్వసిస్తున్నా. ఆయన్ను నేను మూడు కోణాల్లో చూస్తుంటా. నాకు మూడు సినిమాల్లో అవకాశం ఇచ్చిన దర్శకుడిగా, అనుక్షణం నా నటనను సరిదిద్దిన గురువుగా, ఆయన చూపించిన ప్రేమ విషయంలో తండ్రిగా భావిస్తుంటా. నటుడిగా నిలదొక్కుకుంటోన్న సమయంలో ‘శుభలేఖ సినిమా చేసే అవకాశం ఇచ్చారు. వైజాగ్‌లో మొదటిరోజు షూటింగ్‌లో ఉండగా నా దగ్గరకు వచ్చి ‘నిన్ను ఎవరైనా తరుముతున్నారా? అంత వేగంగా డైలాగ్‌ చెబుతున్నావు’ అని అన్నారు. కంగారుగా ఉంది సర్‌ అని చెప్పడంతో నా స్పీడ్‌ను నియంత్రించి, సరిగ్గా చెప్పేలా చేశారు. ఓసారి బెత్తంలాంటిది పట్టుకుని తిరుగుతుంటే.. ఆ స్టైల్‌ నచ్చి అలా డ్యాన్స్‌ చేస్తావా అని అడిగారు. నటుల్లోని ఒరిజినాలిటీని ఆయన చక్కగా రాబట్టుకునేవారు. నేను క్లాసికల్‌ డ్యాన్స్‌ చేయగలనని ఆయన చెప్పేంత వరకూ నాకు తెలియదు. నేను పూర్తిస్థాయిలో మాస్‌ యాక్షన్‌ చిత్రాలు చేస్తున్నప్పుడు ‘స్వయంకృషి’ కథ చెప్పారు. ఆయన శిక్షణతో ఆయా పాత్రల్లో ఒదిగిపోయేవాణ్ని. సున్నితంగా నటించడం ఆయన దగ్గరే నేర్చుకున్నా. మా కాంబినేషన్‌లో వచ్చిన ‘ఆపద్భాంధవుడు’ మరో అపురూప చిత్రం’’ అని అన్నారు.</p><p><img src=\\\"https://media-abn.s3.ap-south-1.amazonaws.com/media/2023/20230211/2_38f8ad94f8.jpg\\\" alt=\\\"2.jpg\\\"></p><p><span style=\\\"color: rgb(255, 0, 0)\\\">అలాంటి దర్శకులు లేరనే చెప్పాలి: సుమలత! (sumalatha)</span></p><p>‘‘నేను సినీ పరిశ్రమలో గురువుగా భావించి పాదాలకు నమస్కరించే ఒకే ఒక వ్యక్తి కె.విశ్వనాథ్‌. నా కెరీర్‌ బ్రిగినింగ్‌లో శుభలేఖ’ సినిమాలోనటించే అవకాశం లభించింది. ఎప్పటికీ మరిచిపోలేని జ్ఞాపకమది. సినిమా విషయంలో ఆయనొక విశ్వవిద్యాయలం. ఆయన చిత్రాల్లో మహిళా పాత్రలు ఎంతో శక్తిమంతంగా ఉంటాయి. అలా చూపించే దర్శకులు లేరనే చెప్పాలి’’ అని సుమలత అన్నారు.</p><p><img src=\\\"https://media-abn.s3.ap-south-1.amazonaws.com/media/2023/20230211/8888_f27a4aff01.jpg\\\" alt=\\\"8888.jpg\\\"></p><p>ఈ కార్యక్రమంలో రమేష్‌ ప్రసాద్‌, మురళీమోహన్‌, శంకరాభరణం ఝాన్సీ, మంజు భార్గవి, రాజ్యలక్ష్మి, శ్రీలక్ష్మి, సబిత, రోజా రమణి, భానుచందర్‌, వి.ఎన్‌.ఆదిత్య, మీనా, జయసుధ, రాధిక, సుమలత, ఆమని, మంజరి ఫడ్నిస్, మాడుగుల నాగఫణిశర్మ, సి.అశ్వినీదత్‌, నరసింహారావు, శివలెంక కృష్ణప్రసాద్‌, అశోక్‌కుమార్‌, యమున కిషోర్‌, ఏడిద శ్రీరామ్‌, ఏడిద రాజా, కాశీ విశ్వనాథ్‌, టి.జి.విశ్వప్రసాద్‌, వివేక్‌ కూచిభొట్ల, ఎస్వీ కృష్ణారెడ్డి, కె.అచ్చిరెడ్డి, పరుచూరి వెంకటేశ్వరరావు, కె.ఎస్‌.రామారావు, తనికెళ్ల భరణి, జీవిత, రాజశేఖర్‌, శేఖర్‌ కమ్ముల, శరత్‌కుమార్‌తోపాటు,కాశీనాథుని నాగేంద్రనాథ్‌, జంధ్యాల శ్రీమతి రాణి తదితరులు పాల్గొన్నారు.</p><p></p><p><img src=\\\"https://media-abn.s3.ap-south-1.amazonaws.com/media/2023/20230211/56_b1722cc4bf.jpg\\\" alt=\\\"56.jpg\\\"></p><p></p>";

			str = str.replaceAll("(<img[^>]+>)", "<amp-img $1</amp-img>")
					.replaceAll("<img ", "")
				.replaceAll("</img>", "");
		System.out.println(str);
		
		
		/*int id = 572114;
		String url = "/2022/andhra-pradesh/east-godavari/sathyadevudu-vazra-kireetam-okngtsandhrapradesh-572114.html";
		int index = url.lastIndexOf("/");
		String uploadFileName = url.substring(0, index+1) + id + ".json";
		System.out.println(uploadFileName);*/
		
		/*String ampVideoUrl = "https://www.dailymotion.com/embed/video/x8icipr";
		String videoId = ampVideoUrl.substring(ampVideoUrl.lastIndexOf("/")+1);
		System.out.println(videoId);*/
	}
 
}
